; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image5 - mode
	image4 - mode
	thermograph2 - mode
	image3 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation4 - direction
	Star6 - direction
	Star3 - direction
	GroundStation2 - direction
	Star5 - direction
	Star1 - direction
	GroundStation0 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument2 thermograph0)
	(supports instrument2 image4)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star5)
	(supports instrument3 image4)
	(supports instrument3 image1)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star1)
	(supports instrument5 thermograph0)
	(supports instrument5 image5)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star5)
	(supports instrument6 image5)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument7 image1)
	(supports instrument7 image4)
	(calibration_target instrument7 Star1)
	(supports instrument8 image4)
	(supports instrument8 image5)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(pointing satellite1 Phenomenon12)
	(pointing satellite2 Planet11)
	(have_image Planet7 image3)
	(have_image Planet8 thermograph2)
	(have_image Phenomenon9 thermograph2)
	(have_image Star10 image3)
	(have_image Planet11 image1)
	(have_image Planet11 image3)
	(have_image Phenomenon12 thermograph2)
	(have_image Star13 image1)
	(have_image Star13 image5)
	(have_image Phenomenon14 image1)
	(have_image Phenomenon14 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation0 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 13
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 13
3. (calibrate satellite3 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 0 of 13
4. (turn_to satellite3 planet7 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet7)
   goals met: 0 of 13
5. (take_image satellite3 planet7 instrument8 image3)
   added: (have_image planet7 image3)
   goals met: 1 of 13
6. (turn_to satellite3 planet11 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet11)
   goals met: 1 of 13
7. (turn_to satellite2 groundstation2 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 13
8. (turn_to satellite1 phenomenon12 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 13
9. (turn_to satellite0 star6 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star6)
   goals met: 2 of 13
10. (take_image satellite3 planet11 instrument8 image3)
   added: (have_image planet11 image3)
   goals met: 3 of 13
11. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 3 of 13
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 13
13. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 3 of 13
14. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 3 of 13
15. (turn_to satellite0 phenomenon12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 13
16. (take_image satellite0 phenomenon12 instrument1 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 4 of 13
17. (turn_to satellite0 phenomenon9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 13
18. (take_image satellite0 phenomenon9 instrument1 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 5 of 13
19. (turn_to satellite0 planet8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet8)
   goals met: 5 of 13
20. (take_image satellite0 planet8 instrument1 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 6 of 13
21. (turn_to satellite2 phenomenon14 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon14)
   goals met: 6 of 13
22. (take_image satellite2 phenomenon14 instrument4 image1)
   added: (have_image phenomenon14 image1)
   goals met: 7 of 13
23. (take_image satellite2 phenomenon14 instrument4 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 8 of 13
24. (turn_to satellite2 star13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star13)
   goals met: 8 of 13
25. (take_image satellite2 star13 instrument4 image1)
   added: (have_image star13 image1)
   goals met: 9 of 13
26. (turn_to satellite2 planet11 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 planet11)
   goals met: 10 of 13
27. (take_image satellite2 planet11 instrument4 image1)
   added: (have_image planet11 image1)
   goals met: 11 of 13
28. (turn_to satellite3 star10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star10)
   goals met: 11 of 13
29. (take_image satellite3 star10 instrument8 image3)
   added: (have_image star10 image3)
   goals met: 12 of 13
30. (turn_to satellite3 star13 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star13)
   goals met: 12 of 13
31. (take_image satellite3 star13 instrument8 image5)
   added: (have_image star13 image5)
   goals met: 13 of 13
